teleprompter-app-api/app/controllers/scripts_controller.rb

SELECT "scripts".* FROM "scripts"
---
    def index
        scripts = Script.all

SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        script = Script.find(params[:id])

INSERT INTO "scripts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "New Script - 1565978444814"], ["content", "<p>hkjhjk</p><p>hkhjhhkj</p><p>kjkhjhkjhkj</p>"], ["created_at", "2019-08-16 18:00:56.200463"], ["updated_at", "2019-08-16 18:00:56.200463"]]
---
      def create
        script = Script.create(script_params)

SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "scripts" SET "content" = $1, "updated_at" = $2 WHERE "scripts"."id" = $3  [["content", "<p>dfgdfgd</p><p>dfg</p><p>dgg</p><p>dfgdggd</p><p><br></p>"], ["updated_at", "2019-08-16 19:23:17.501387"], ["id", 11]]
---
    def update
      script = Script.find_by(id: params[:id])
      script.update(script_params)

SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "scripts" WHERE "scripts"."id" = $1  [["id", 1]]
---
    def destroy
      script = Script.find_by(id: params[:id])
      script.destroy