teleprompter-app-api/app/controllers/speakers_controller.rb

SELECT "speakers".* FROM "speakers"
---
    def index
      speakers = Speaker.all

SELECT  "speakers".* FROM "speakers" WHERE "speakers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      speaker = Speaker.find_by(id: params[:id])